USE `students_db` ;

TRUNCATE TABLE student_group;
TRUNCATE TABLE region;
TRUNCATE TABLE city;
TRUNCATE TABLE graduated_secondary_school;
TRUNCATE TABLE student;
TRUNCATE TABLE debt;
TRUNCATE TABLE student_has_debt;

INSERT into student_group(`name`, `number`, entry_year) VALUES
("ІР", "21", 2020),
("ІР", "22", 2020),
("ІР", "23", 2020),
("КІ", "32", 2019),
("ПМІ", "11", 2021),
("ПМІ", "25", 2020);

INSERT into region(`code`,`name`) VALUES
("07", "Волинська область"),
("18", "Житомирська область"),
("23", "Запорізька область"),
("46", "Львівська область"),
("53", "Полтавська область"),
("63", "Харківська область"),
("68", "Хмельницька область"),
("80", "м. Київ"),
("12", "Дніпропетровська область");


INSERT into city(`name`, `region_code`) VALUeS
("Ковель", "07"),
("Житомир", "18"),
("Запоріжжя", "23"),
("Львів", "46"),
("Полтава", "53"),
("Харків", "63"),
("Хмельницький", "68"),
("Київ", "80"),
("Дніпро", "12");


INSERT into graduated_secondary_school(`name`, phone_number, director_fullname, city_id) VALUES
("АББЗЛ", "+380938464406", "Яхно Живосил Сарматович", 2),
("ББП", "+380633760376", "Свистун Азарій Левович", 5),
("БЗОТ", "+380509938348", "Дочинець Євгеній Макарович", 4),
("ГІЦ", "+380716408094", "Ренькас Осмомисл Семенович", 1),
("ВІБДР", "+380502187163", "Онисько Давид Ярославович", 3),
("ДЛА", "+380501605987", "Баранник Царук Вадимович", 7),
("ЕКУ", "+380663448847", "Білокінь Ходота Драганович", 9);

INSERT into student(surname ,`name`, patronymic, overall_rate, birth_date, entry_date, email, student_identity_card, student_group_id, graduated_secondary_school_id, city_id) VALUES
("Фешовець", "Пимон", "Костянтинович", 78.5, "2002-09-12", "2019-01-22", "High@gmail.com", "A21616393G", 1, 1, 1),
("Кислий", "Іоанн", "Сарматович", 66.9, "1994-01-16", "2020-09-06", "Shivering@gmail.com", "A22671815N", 2, 1, 4),
("Мізецький", "Первушко", "Олександрович" ,75.7, "1995-04-08", "2019-01-03", "Jumpy@gmail.com", "A25057037L", 1, 3, 6),
("Бурбак", "Христофор", "Сарматович", 56.2, "2003-02-03", "2020-05-03", "Amused@gmail.com", "A28509818J", 4, 3, 5),
("Шимків", "Семирад", "Соломонович", 90.9, "2003-11-26", "2019-05-08", "Didactic@gmail.com", "A54451762K", 2, 2, 4),
("Белонович", "Брячислав", "Денисович", 86.4, "2002-03-02", "2020-09-26", "Detailed@gmail.com", "A62599650O", 3, 5, 5),
("Могитич", "Щедра", "Федорівна", 89.4, "1995-12-18", "2021-03-21", "Harmonious@gmail.com", "A81374072H", 4, 2, 7),
("Трифонюк", "Лілія", "Романівна", 48.9, "2000-04-06", "2020-02-25", "Blue@gmail.com", "A83053522M", 5, 6, 4);

INSERT into debt(lesson_name) VALUES
("Диференціальні рівняння"),
("Українська мова"),
("Англійська мова"),
("Комп'ютерна електроніка"),
("Алгоритми та структури даних"),
("Лінійна алгебра"),
("Теорія імоврності");

INSERT into student_has_debt(student_id, debt_id) VALUES
(1, 1),
(3, 2),
(5, 3),
(2, 4),
(6, 5),
(5, 6),
(3, 7);
